# Используем официальный образ Node.js версии 20 как базовый
FROM node:20

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл package.json (список зависимостей и метаданные проекта)
COPY package.json ./

# Копируем файл package-lock.json для точной фиксации версий зависимостей
COPY package-lock.json ./

# Устанавливаем зависимости строго по lock-файлу (npm ci быстрее и надёжнее для CI/CD)
RUN npm ci

# Копируем все остальные файлы проекта в контейнер
# копирует все файлы и папки из контекста сборки (обычно это корень проекта, где лежит Dockerfile)
#  в текущую рабочую директорию контейнера, которая была задана ранее.
# Левая точка (.) — это путь на хосте, относительно контекста сборки (например, . означает "всё из текущей директории").

# Правая точка (.) — это путь внутри контейнера, относительно текущего WORKDIR, то есть /app.

# В результате все файлы проекта (кроме тех, что исключены .dockerignore) окажутся в /app внутри контейнер
COPY . .

# Открываем порт 4545 для внешних подключений (например, если приложение слушает на этом порту)
EXPOSE 4545

# Указываем команду запуска приложения — node src/index.js
CMD ["node", "src/index.js"]
